[
    {
        "project_id": "EXA-10-1999",
        "project_id_path": "1999-10-EXA",
        "published": false,
        "title": {
            "de": "title that will appear on the website",
            "en": "title that will appear on the website"
        },
        "start": "1999-10",
        "end": "1970-10",
        "repo": {
            "url": "github url",
            "public": false
        },
        "links": {
            "en": [
                "you can add markdown here like 'this is the [CorrelAid website](https://correlaid.org)'",
                "you can add markdown here like 'this is the [CorrelAid website](https://correlaid.org)'"
            ],
            "de": [
                "you can add markdown here like 'this is the [CorrelAid website](https://correlaid.org)'",
                "you can add markdown here like 'this is the [CorrelAid website](https://correlaid.org)'"
            ]
        },
        "organization": {
            "name": "",
            "website": "",
            "about": {
                "de": {
                    "text": "",
                    "source": "markdown describing the source (if applicable)"
                },
                "en": {
                    "text": "",
                    "source": "markdown describing the source (if applicable) - if translated from German original source write 'translated from [url]()'"
                }
            }
        },
        "description": {
            "de": {
                "summary": "",
                "problem": "",
                "data": "",
                "approach": "",
                "impact": ""
            },
            "en": {
                "summary": "",
                "problem": "",
                "data": "",
                "approach": "",
                "impact": ""
            }
        },
        "team": [
            {
                "first_name": "",
                "last_name": "",
                "github": "github username",
                "twitter": "twitter username",
                "linkedin": "full linkedin url",
                "website": "full website url",
                "email": "",
                "pgp": "public pgp key"
            }
        ],
        "year": 1999
    },
    {
        "project_id": "WEL-06-2019",
        "project_id_path": "2019-06-WEL",
        "title": {
            "de": "Automatisierte Reportgenerierung zur Verbesserung der Arbeit der Weltläden",
            "en": "Automating report generation to improve the work of World Shops"
        },
        "year": 2019,
        "start": "2019-06",
        "end": "2020-02",
        "published": true,
        "repo": {
            "url": "https://github.com/CorrelAid/weltladen",
            "public": false
        },
        "links": {
            "en": [
                "[Podcast episode](https://soundcloud.com/correlaid_podcast/about-correlaid-automatisierte-reportgenerierung-fur-die-weltladen) about the project (in German)"
            ],
            "de": [
                "[Podcast-Episode](https://soundcloud.com/correlaid_podcast/about-correlaid-automatisierte-reportgenerierung-fur-die-weltladen) über das Projekt"
            ]
        },
        "organization": {
            "name": "Weltladen Dachverband",
            "website": "https://www.weltladen.de/",
            "about": {
                "de": {
                    "text": "Der Weltladen-Dachverband ist das zentrale Netzwerk der Weltläden und Aktionsgruppen für Fairen Handel auf Bundesebene. Er ist als Verein organisiert und hat seine Geschäftsstelle in Mainz. Rund 460 der ca. 900 Weltläden in Deutschland sind Mitglied im Weltladen-Dachverband. Er unterstützt Weltläden in allen Bereichen ihrer Arbeit, entwickelt Informations-, Kampagnen und Schulungsmaterialien, bietet Fortbildungen an und organisiert mit den jährlichen Weltladen-Fachtagen das größte Treffen für Weltläden und ihre Partner.  Mit seinen Überprüfungs- und Monitoringinstrumenten leistet er darüber hinaus einen wertvollen Beitrag zur Glaubwürdigkeit der Weltläden.",
                    "source": "[Quelle](https://www.weltladen.de/weltladen-dachverband/)"
                },
                "en": {
                    "text": "The Weltladen Dachverband (Weltladen Umbrella Association) is the central network of the World Shops and Action Groups for Fair Trade at the national level. It is organised as an association and has its office in Mainz. Around 460 of the approx. 900 World Shops in Germany are members of the World Shop Umbrella Association. It supports World Shops in all areas of their work, develops information, campaigns and training materials, offers further training and organises the annual World-Shop-Fachtage, the largest meeting for World Shops and their partners.  With its inspection and monitoring instruments, it also makes a valuable contribution to the credibility of the World Shops.",
                    "source": "translated from [here](https://www.weltladen.de/weltladen-dachverband/)"
                }
            }
        },
        "description": {
            "de": {
                "summary": "",
                "problem": "Der Weltladen Dachverband und das Eine Welt Netzwerk Bayern (im Weiteren nur Weltladen Dachverband) führen jedes Jahr Befragungen ihrer Mitglieder - einzelne Weltläden - durch, um deren Situation und Bedürfnisse besser zu verstehen. Den Mitgliedern soll außerdem nutzenbringendes Feedback bzgl. ihrer Stellung im Vergleich zu den andern Weltläden gegeben werden.\n\nDer Anspruch der Umfrage ist es, jedem Weltladen, der an der Umfrage teilnimmt, eine individualisierte Rückmeldung zu geben. Der entsprechende Report enthält verschiedene Grafiken und deskriptive Statistiken, der es den einzelnen Weltläden erlaubt, ihre Situation im Vergleich zu anderen Weltläden einzuschätzen. Die se individuellen Reports wurden vor Projektbeginn händisch mit Excel und Word erstellt. Bei mehreren hundert teilnehmenden Mitgliedern war dies ein sehr zeitaufwändiger und fehleranfälliger Prozess, welcher von den zumeist ehrenamtlichen Mitarbeitern des Weltladen Dachverbands nur schwer gestemmt werden konnte.\n\nDer Weltladen Dachverband wollte diesen Prozess automatisieren. Darüber hinaus sollten durch statistische Analysen zusätzliche Zusammenhänge in der Struktur der Weltläden aufgedeckt werden.",
                "data": "Die Daten basierten auf einer durchgeführten Online-Umfrage unter den Weltläden. Der Datensatz umfasste dabei eine dreistellige Zahl an teilnehmenden Läden und mehrere dutzende Variablen.\n\nDie Daten wurden aus dem Online-Umfrage-Tool als .csv-Dateien exportiert und dem CorrelAid Team bereitgestellt.  Während des Projekts wurden die Daten ausschließlich auf den Systemen des Dachverbands sowie CorrelAid-Servern gespeichert, sodass ein Zugang durch unberechtigte Dritte ausgeschlossen werden konnte.\n",
                "approach": "CorrelAid konnte dem Team des Weltladen Dachverbands helfen, indem die manuelle und somit fehleranfällige und sehr zeitaufwendige Erstellung von individualisierten Berichten automatisiert wurde. Hierzu wurden die frei zugängliche Statistik-Software R sowie implizit das Textsatzsystem Latex zum Erstellen von Tabellen innerhalb der Berichte verwendet.\n\nIm Zuge des Projekts wurden außerdem Vorschläge zur Optimierung der Fragebögen entwickelt und umgesetzt. \n\n\nUm eine langfristige Wirkung des Projekts sicherzustellen, wurde darauf geachtet, das Team des Dachverbands dazu zu befähigen, die Analyse zukünftig selbst auszuführen. \nDie von CorrelAid entwickelten Skripte wurden hierzu ausführlich und persönlich mit Mitarbeiter:innen des Dachverbands besprochen und deren Durchführung umfangreich getestet. Außerdem wurde der Code sinnvoll kommentiert. Für Nachfragen stand das Projektteam außerdem zusätzlich zur Verfügung, worauf der Weltladen Dachverband auch wiederholt zurück gegriffen hat. Die Durchführung auf der lokalen Maschine der Mitarbeiter:innen läuft mittlerweile reibungslos.\n\n\n### Technischer Lösungsansatz\nDie Daten wurden mit R eingelesen und aufbereitet (Datenqualitätskontrolle, Aggregation, Erstellen neuer Variablen). Dabei wurden deskriptive Auswertungen für alle Läden sowie für die individuellen Läden und ihre jeweilige Peergroup durchgeführt. Die Ergebnisse wurden für die individualisierten Berichte benötigt, welche wiederum mit Rmarkdown generiert wurden. Tabellen in den Berichten wurden mit dem R-Paket kableExtra erstellt, die Grafiken mittels ggplot2. Der gesamte Prozess kann nun für alle für alle teilnehmenden Weltläden angestoßen werden und läuft dann automatisch durch.\n",
                "impact": "\nDank des Automatisierungsansatzes kann der Weltladen Dachverband die Berichte nun einfacher, dauerhafter und mit sehr viel weniger Aufwand erstellen. Außerdem konnte die Validität der Daten verbessert werden.\n\nDer Weltladen Dachverband hat außerdem durch das Projekt ein besseres Verständnis für die generelle Herangehensweise bei datengetriebenen Auswertungen bekommen. Dazu gehören Aspekte wie die Erstellung der Umfrage bereits mit Hinblick auf die spätere Auswertung der Daten und Überlegungen bzlg. der Datenqualitätsanalyse. Auch die eingesetzen Tools und ihre Möglichkeiten wurden vermittelt.\n\nDie CorrelAid-Ehrenamtlichen konnten ihrerseits  ein besseres Verständnis für die Bedürfnisse/Arbeitsweise von NGOs im Allgemeinen und den Weltläden im Speziellen gewinnen. Außerdem konnten sie im Rahmen des Projekts viel voneinander lernen - sowohl in Bezug auf Tools als auch auf die Vorgehensweise und Art der Zusammenarbeit."
            },
            "en": {
                "summary": "",
                "problem": "The Weltladen Umbrella Association (de: Weltladen Dachverband) and the Eine Welt Netzwerk Bayern (in the following only Weltladen Umbrella Association) conduct surveys of their members - individual World Shops - every year in order to better understand their situation and needs. The members are also to be given useful feedback regarding their position in comparison to the other members / shops.\n\nThe purpose of the survey is to provide individualized feedback to each World Shop that participates in the survey. The report contains various plots and descriptive statistics that allow each Weltladen to assess its situation in comparison to other shops. Before the CorrelAid project, the individual reports had been created manually with Excel and Word. With several hundred participating members, this was a very time-consuming and error-prone process, which was difficult to manage by the mostly volunteer staff of the Weltladen Umbrella Association.\n\nHence, the Weltladen Umbrella Association wanted to automate this process. Furthermore, statistical analyses were conducted to reveal additional correlations in the structure amongst the members of the Weltladen Umbrella Association.\n",
                "data": "The data was based on an online survey of the individual World Shops. The data set included a several hundred  participating shops and several dozens of variables.\n\nThe data was exported from the online survey tool as .csv files and made available to the CorrelAid team.  During the project, the data was stored exclusively on the Weltladen Assocation's systems and CorrelAid servers to prevent unauthorised access.\n\n",
                "approach": "CorrelAid was able to help the Weltladen Umbrella Association team by automating the manual and therefore error-prone and very time-consuming creation of the individual reports. For the automation, the freely accessible statistics software R and implicitly the text typesetting system Latex (to create tables within the reports) were used.\n\nIn addition, suggestions for the optimization of the questionnaires were developed and implemented over the course of the project. \n\nIn order to ensure a long-term effect of the project, care was taken to enable the Weltladen Umbrella Association's team to carry out the report creation process themselves in the future. \nTo this end, the scripts developed by CorrelAid were discussed in detail and in person with staff from the Weltladen Assocation and their implementation was tested extensively. In addition, the code was meaningfully commented. The project team was also available to answer questions, an offer which the Weltladen Umbrella Association has repeatedly made use of. The implementation on the local machine of the Weltladen staff is now running smoothly.\n\n\n### Technical solution approach\nThe data were read in and wrangled with R (data quality control, aggregation, creation of new variables). Descriptive evaluations were carried out for all shops as well as for the individual shops and their respective peer groups. The results were needed for the individualized reports which were generated with Rmarkdown. Tables in the reports were created with the R package kableExtra, the graphics with ggplot2. The whole process can now be started for all participating Weltladen shops and runs automatically.\n\n",
                "impact": "\nThanks to the automation approach, the Weltladen Umbrella Association can now create reports more easily, on a more regular basis and with much less effort. The validity of the data has also been improved.\n\nIn addition, the project has given the Weltladen Umbrella Association a better understanding of the general approach to data-driven processes and decision making. For example, the staff now knows that when designing surveys they need to consider the potential impact of design decisions on the quality and analysis of the data. Finally, the Weltladen Assocation was introduced to the tools  used and their possibilities.\n\nOn the other side, the CorrelAid volunteers were able to gain a better understanding of the needs and internal workings of NGOs in general and the World Shops in particular. The project also allowed them to learn a lot from each other, both with regards to tools and collaboration.\n"
            }
        },
        "team": [
            {
                "first_name": "Gideon",
                "last_name": "May",
                "github": "",
                "twitter": "",
                "linkedin": "https://www.linkedin.com/in/gideon-may-248790151/",
                "website": "",
                "xing": "https://www.xing.com/profile/Gideon_May2/cv"
            },
            {
                "first_name": "Johannes",
                "last_name": "Rabenschlag",
                "github": "jrabensc",
                "twitter": "",
                "linkedin": "https://www.linkedin.com/in/jrabensc/",
                "website": ""
            },
            {
                "first_name": "Raphael",
                "last_name": "Riege",
                "github": "",
                "twitter": "",
                "linkedin": "https://www.linkedin.com/in/raphael-riege-aa15a914b/",
                "website": ""
            },
            {
                "first_name": "Stefan",
                "last_name": "Boschenriedter",
                "github": "",
                "twitter": "",
                "linkedin": "https://www.linkedin.com/in/stefan-boschenriedter-5417a2134/",
                "website": ""
            }
        ]
    },
    {
        "project_id": "DEN-03-2020",
        "project_id_path": "2020-03-DEN",
        "title": {
            "de": "Wer ist interessiert an einem guten Leben im ländlichen Raum?",
            "en": "Who is interested in a good life for the elderly in rural areas?"
        },
        "year": 2020,
        "start": "2020-03",
        "end": "2020-08",
        "published": true,
        "repo": {
            "url": "https://github.com/CorrelAid/denkmalkultur",
            "public": false
        },
        "links": {
            "de": [
                "[Artikel in der Berliner Zeitung](https://www.berliner-zeitung.de/mensch-metropole/ein-herrenhaus-in-der-warteschleife-li.102754)"
            ],
            "en": [
                "[Article in Berliner Zeitung (in German)](https://www.berliner-zeitung.de/mensch-metropole/ein-herrenhaus-in-der-warteschleife-li.102754)"
            ]
        },
        "organization": {
            "name": "denk-mal-kultur e.V.",
            "website": "https://www.schloss-heinersdorf.info/denk-mal-kultur_e_v_/",
            "about": {
                "de": {
                    "text": "Der Verein Denk-mal-Kultur e.V. [...] versucht nun, weiterhin kulturelle Höhepunkte zu organisieren, hat sich aber auch das Ziel gestellt, den historischen Dorfkern Heinersdorfs zu bewahren und aktiv die Sanierung der Kirche und des Herrenhauses zu unterstützen. Der Verein setzt sich in erster Linie für die beiden Denkmäler Kirche und Schloß Heinersdorf ein und möchte auch weiterhin kulturelle Veranstaltungen dort anbieten. Denk-mal-Kultur e.V. kümmert sich somit um Denkmäler und Kultur im weiteren Sinne. Vordringlich kümmern wir uns jedoch momentan um das Projekt Herrenhaus Heinersdorf.",
                    "source": "[Quelle](https://www.schloss-heinersdorf.info/denk-mal-kultur_e_v_/)"
                },
                "en": {
                    "text": "The association Denk-mal-Kultur e.V. [...] aims to continue to organize cultural highlights, but has also set itself the goal of preserving Heinersdorf's historic village center and actively supporting the restoration of the church and the manor house. The association is primarily committed to the church and manor house Heinersdorf and wants to continue to offer cultural events there. Denk-mal-Kultur e.V. thus takes care of monuments and culture in a broader sense. At the moment, however, we are primarily concerned with the Heinersdorf Manor House project.",
                    "source": "translated from [here](https://www.schloss-heinersdorf.info/denk-mal-kultur_e_v_/)"
                }
            }
        },
        "description": {
            "de": {
                "summary": "",
                "problem": "Denk-mal-Kultur e.V. kümmert sich in erster Linie um das Herrenhaus Heinersdorf. Gemeinsam mit Partnern möchte Denk-mal-Kultur e.V. in dem Herrenhaus eine Akademie für selbstbestimmtes Altwerden auf dem Land einrichten. In diesem Kontxt soll auch eine Praxisforschungsstelle gegründet werden, die sich der folgenden Frage annimmt: \"Wie kann man das Älterwerden in ländlichen Gebieten am besten bewältigen?\" Als sie mit CorrelAid Kontakt aufnahmen, standen die Organisator:innen ganz am Anfang des Projekts und benötigten Unterstützung, um herauszufinden, ob die lokale Bevölkerung und andere relevante Akteure (Politik, Verwaltung, Pflegepersonal und medizinisches Personal) an der Praxisforschungsstelle interessiert sind. Die Ehrenamtlichen von Denk-Mal-Kultur hatten einen groben Umfrageentwurf vorbereitet, suchten aber Hilfe, um diesen zu präzisieren, eine Online-Umfrage durchzuführen und die Ergebnisse zu analysieren. Von den Ergebnissen erhofften sie sich handlungsrelevante Erkenntnisse für die Initiative, die bei weiteren Aktivitäten helfen könnten, z.B. bei der Kontaktaufnahme mit potenziellen Projektpartnern oder bei der Suche nach Fundraising-Möglichkeiten.",
                "data": "Die Daten wurden im Rahmen des Projekts mit einer Umfrage erhoben (weitere Details siehe unten). Zusätzlich zu den Umfragedaten nutzte das CorrelAid Team für die Region verfügbare offene Daten vom Statistischen Informationssystem Berlin-Brandenburg ([StatIS-BBB](https://www.statistik-berlin-brandenburg.de/regionales/inhalt-regionales.asp)).",
                "approach": "Das CorrelAid Team hat die Verbesserung des Umfragedesigns unterstützt, indem es nicht nur die wichtigsten themenbezogenen Fragen, sondern auch demographische Fragen wie zur Erfassung des Geschlechts und des Bildungstands entwickelt hat. Nach erfolgreichem Design des Fragebogens in Absprache mit Denk-Mal-Kultur führte das CorrelAid Team die Online-Umfrage mithilfe von [SoGo](https://www.sogosurvey.com/) durch. Etwa 140 Bürgerinnen und Bürger sowie relevante Stakeholder beantworteten die Umfrage.\n\n\nMithilfe der demographischen Daten konnte überprüft werden, ob es Unterschiede zwischen verschiedenen potenziellen Nutzer:innen und Interessengruppen gibt. Außerdem wurde die Repräsentativität der Umfrage evaluiert: Hierzu glich das Team einige der Merkmale (z.B. Geschlecht und Bildung) mit den offiziellen Statistiken der Region ab. \n\n\nDas CorrelAid-Team erstellte einen PDF-Bericht mit vielen nützlichen Grafiken und deren Interpretationen. Die Analyse identifizierte relevante Interessengruppen, Themen, Kommunikationskanäle und Interaktionsformen. Sie ergab unter anderem, dass die Praxisforschungsstelle bei Frauen mehr Interesse weckt als bei Männern.",
                "impact": "Das Projekt hatte zwei Effekte: Zum einen deuteten die Umfrageergebnisse darauf hin, dass generell ein großes Interesse bei allen Befragten besteht, sowohl in der Bevölkerung als auch bei den relevanten Stakeholdern. Dieses Ergebnis gibt nicht nur allen Mitgliedern des Denk-Mal-Kultur Teams für die Praxisforschungsstelle einen Motivationsschub, sondern erleichtert auch die Ansprache von Ministerien und anderen potenziellen Förderern bei Fundraising-Aktivitäten. \n\n\nZweitens erleichtern die Umfrageergebnisse dem Denk-Mal-Kultur Team die Priorisierung der Aktivitäten nach Interesse und möglicher Unterstützung durch lokale Interessenvertreter:innen. Kurz gesagt, sie bietet eine solide, nutzerorientierte Grundlage für zukünftige Aktivitäten, die auf den Aufbau der Akademie für selbstbestimmtes Altwerden und der Praxisforschungsstelle abzielen."
            },
            "en": {
                "summary": "",
                "problem": "Denk-mal-Kultur e.V. primarily cares for the Heinersdorf Manor. Together with partners, Denk-mal-Kultur e.V. would like to establish an *academy for self-determined aging*. In this context, a practical research center tackling the question: „How can one best manage growing older in rural areas?“ should be established as well. When Denk-Mal-Kultur contacted CorrelAid, they were at the very beginning of scoping the project and asked for support in finding out whether the local population and potential stakeholders (politics, administration, care givers and medical staff) were interested in the endeavour of creating a practical research center. They had a rough survey draft but were seeking help in making it more precise, setting up an online survey, and analyzing the results to get actionable insights for the initiative  that could help in further activities, e.g. contacting potential project partners or pursuing fundraising opportunities.",
                "data": "Data were collected as part of the project with a survey (more details below). In addition to the survey data, the CorrelAid team made use of Open Data available for the region from the Statistical Information System Berlin-Brandenburg ([StatIS-BBB](https://www.statistik-berlin-brandenburg.de/regionales/inhalt-regionales.asp)).",
                "approach": "CorrelAid supported in improving the survey design by designing not only the key questions with regards to the research center but also demographical questions such as gender and education. CorrelAid then implemented the online survey using [SoGo](https://www.sogosurvey.com/). About 140 citizens as well as relevant stakeholders answered the survey. \n\n\nUsing the demographical data, the CorrelAid team was able to check whether there were differences across different potential users or stakeholders. In addition, the team used those demographics to evaluate the representativeness of the survey data: to do so, the team compared some of the characteristics (e.g. gender and education) to the offical statistics of the region. \n\n\nThe CorrelAid Team prepared a PDF report with many useful graphs and their interpretations. The analysis identified relevant interest groups, topics, communication channels, and forms of interaction. Among other results, it showed that the practical research center sparks more interest among women.",
                "impact": "The effects are twofold: First, the survey results indicated that there is a large interest among all that were surveyed, both among the population as well as the relevant stakeholders. This result not only gives all members of the Denk-Mal-Kultur steering committee for the \"academy\" and the practical research center a confidence boost but also makes it easier to approach ministries and other potential sponsers in fundraising. \n\n\nSecond, the survey results make it easier for the steering committee to rank activities by interest and potential support of local stakeholders. In short, it provides a solid, user-oriented foundation for future activities that are aimed at setting up the *academy for self-determined aging* and the practical research center.\n"
            }
        },
        "team": [
            {
                "first_name": "Sylvi",
                "last_name": "Rzepka",
                "github": "",
                "twitter": "",
                "linkedin": "https://www.linkedin.com/in/sylvi-rzepka",
                "website": ""
            },
            {
                "first_name": "Theresa",
                "last_name": "Gasinski",
                "github": "",
                "twitter": "",
                "linkedin": "https://www.linkedin.com/in/theresagasinski/",
                "website": ""
            },
            {
                "first_name": "Gino",
                "last_name": "Liguori",
                "github": "",
                "twitter": "",
                "linkedin": "",
                "website": ""
            },
            {
                "first_name": "Florian",
                "last_name": "Kaiser",
                "github": "",
                "twitter": "",
                "linkedin": "",
                "website": ""
            }
        ]
    },
    {
        "project_id": "ERL-03-2020",
        "project_id_path": "2020-03-ERL",
        "published": true,
        "title": {
            "de": "Interaktives Dashboard zur besseren Darstellung von Verschuldungsdaten",
            "en": "Making debt reduction advocay more engaging with an interactive dashboard"
        },
        "year": 2020,
        "start": "2020-03",
        "end": "2020-08",
        "repo": {
            "url": "https://github.com/CorrelAid/erlassjahr/",
            "public": true
        },
        "links": {
            "en": [
                "[Interactive Dashboard](https://erlassjahr.de/informieren/karte-ueberschuldete-staaten-weltweit/) on the page of Erlassjahr e.V."
            ],
            "de": [
                "[Interaktives Dashboard](https://erlassjahr.de/informieren/karte-ueberschuldete-staaten-weltweit/) auf der Seite von Erlassjahr e.V."
            ]
        },
        "organization": {
            "name": "Erlassjahr e.V.",
            "website": "https://erlassjahr.de",
            "about": {
                "de": {
                    "text": "Das deutsche Entschuldungsbündnis **„erlassjahr.de – Entwicklung braucht Entschuldung e. V.“** setzt sich dafür ein, dass den Lebensbedingungen von Menschen in verschuldeten Ländern mehr Bedeutung beigemessen wird als der Rückzahlung von Staatsschulden. erlassjahr.de wird von derzeit über 600 Organisationen aus Kirche, Politik und Zivilgesellschaft bundesweit getragen und ist eingebunden in ein weltweites Netzwerk nationaler und regionaler Entschuldungsinitiativen.",
                    "source": "[Quelle](https://erlassjahr.de/ueber-uns/)"
                },
                "en": {
                    "text": "The German jubilee network **„erlassjahr.de / Jubilee Germany“** wants to achieve that more importance is attached to the living conditions of people in indebted countries than to the servicing of sovereign debt. At present, Jubilee Germany is supported by over 600 organisations out of church, politics and civil society throughout Germany and is involved in a worldwide network of national and regional jubilee initiatives.",
                    "source": "[Source](https://erlassjahr.de/en/about-us/)"
                }
            }
        },
        "description": {
            "de": {
                "summary": "",
                "problem": "erlassjahr.de setzt sich für faire und transparente Verfahren beim Schuldenerlass weltweit ein. Wie bei vielen anderen NGOs stellt die Interaktion mit interessierten Nutzer:innen über den eigenen Webauftritt eine Herausforderung dar. Bisher wurden die Rechercheergebnisse zum Schuldenstand der Länder in einem jährlich veröffentlichten Schuldenreport publiziert und nur anhand einer statischen PDF Karte anschaulich dargestellt.\n\n\nDie Zusammenstellung der Daten und die Anfertig der Karte waren dabei mit viel Aufwand und manueller Arbeit verbunden. Die Informationen mussten aus diversen Quellen gesammelt und in eine Excel-Tabelle kopiert werden, um dann daraus eine entsprechende Karte manuell einzufärben. Diese vielen einzelne, kleinteilige und größtenteils per Hand ausgeführten Arbeitsschritte bedeuteten viel Arbeitzeit für das Team von erlassjahr - Arbeitszeit, die man einsparen kann, indem man diverse Schritte in diesem Prozess automatisiert, vereinfacht und das Endergebnis in Form einer Weltkarte interaktiver und erlebbarer gestaltet.\n\n\nCorrelAid hat [erlassjahr.de](http://erlassjahr.de/) dabei unterstützt, sowohl die Datenbeschaffung als auch die Bereitstellung der Rechercheergebnisse mit einer [interaktive Weltkarte](https://erlassjahr.de/informieren/karte-ueberschuldete-staaten-weltweit/) zu verbessern. Damit erhöht sich die Reichweite, intensiviert sich das Nutzererlebnis des Schuldenreports und der Weltkarte und erlaubt es dem Team von erlassjahr mehr Zeit für ihre individuelle Recherarbeit zu verwenden.\n",
                "data": "Als bisherige Datengrundlage für die Erstellung des Schuldenreports dienten eine Vielzahl von unterschiedlichen und oftmals manuell erarbeiteten Quellen. Dazu zählen unter anderem die Weltbank, der Internationale Währungsfond, CIA World Factbook, die Regierungsseiten der Länder oder auch Artikel in der (Finanz-)Presse. Alle Informationen werden in einer Excel-Tabelle gesammelt.\n\n\nDiese Rohdaten bilden die Berechnungsgrundlage für verschiedene Schuldenindikatoren (z.B. öffentliche Schulden relativ zu den Staatseinnahmen oder der Auslandsschuldenstand im Verhältnis zum BIP), durch die Länder in bestimmte Verschuldungskategorien einteilt werden. Diese Kategoriesierung wird im Herzstück des jährlichen Schuldenreports anhand einer Weltkarte dargestellt. Bisher wurde hierfür jedes einzelne Land in Adobe Indesign entsprechend ihrer Verschuldungskategorie eingefärbt und konnte somit nur den aggregierten Schuldenstand aus allen Schuldenindikatoren grafisch abbilden.\n",
                "approach": "Um diese Prozesse zu automatisieren und eine nutzerfreundlichere Interaktion mit den Recherchereergebnissen zu ermöglichen, teilt sich unser Lösungsansatz in zwei große Arbeitsschritte auf:\n\n1. Die (teilweise) Automatisierung der Datengenerierung und -verarbeitung.\n2. Die Erstellung einer [interaktiven Weltkarte](https://erlassjahr.de/informieren/karte-ueberschuldete-staaten-weltweit/), die automatisch auf die aktualisierten Daten zugreift\n\nAlle Schritte wurden in R programmiert. Das Erscheinungsbild der Weltkarte basiert auf leaflet - einer Java-basierten OpenSource Bibliothek zur Erstellung von interaktiven Karten. Zur Erstellung der Weltkarte und zur Veröffentlichung auf der Homepage der Organisation nutzen wir shiny. \n\n### 1. Automatisierung der Datengenerierung und -verarbeitung\n\nUm die Organisation bei der Datengenerierung und -aufbereitung zu unterstützen, haben wir zunächst sicher gestellt, dass bestimmte, bisher manuell bearbeitete Aufgaben automatisiert werden. Hierzu haben wir ein Skript geschrieben, durch das zu Beginn eines jeden neuen Schuldenreportjahres eine neue Excel-Tabell erstellt wird, die dadurch bereits eine Vielzahl von Informationen beinhaltet. Dafür nutzen wir zum einen die Informationen aus dem Schuldenreport im vergangenen Jahr und übernehmen direkt alle Informationen, die sich nicht von Jahr zu Jahr ändern. Hierzu zählen z.B. die geografischen Regionen oder auch die Links zu den Länderprofilen auf der Website von erlassjahr. Darüberhinaus werden alle vorhandenen Daten der Weltbank zu verschiedenen Verschuldungskategorieren geladen und direkt in die Excel-Tabelle eingefügt. Diese Rohdaten wurden bisher händisch von der Webseite der Weltbank kopiert und in eine Excel-Tabelle eingefügt. Durch unsere Automatisierung entfällt dieser Schritt und muss nur noch bei fehlenden Daten manuell ergänzt werden.\n\n\nBei der Beschaffung anderer Rohdaten, konnte keine vergleichbare Automatisierung eingearbeitet werden, da die Daten oftmals durch intensive Recherche aus einer Vielzahl von wechselnden Quellen entstehen. Sobald diese jedoch manuell in die Excel-Tabelle eingefügt wurden, ist es nun möglich mit einem zweiten Skript die Berechnung der Indikatoren und Kategorisierungen zu automatisieren. Hierfür haben nutzen wir die Rohdaten der Excel-Tabelle und kreieren automatisch Einstufungen der Länder in höhere oder nedrigere Verschuldungskategorien. \n\n### 2. Erstellung einer interaktiven Weltkarte\n\nBasierend auf der neu generierten Datengrundlage, haben wir im zweiten Schritt eine [interaktive Weltkarte](https://erlassjahr.de/informieren/karte-ueberschuldete-staaten-weltweit/) mit shiny und leaflet programmiert. Diese Karte greift dabei immer auf die neusten Daten, die erlassjahr vorliegen zu und kann dadurch stetig aktualisiert werden, sollte es Veränderungen in der derzeitigen Schuldensituation geben, die in der Karte eingearbeitet werden sollen.\n\n\nDer interaktive Charakter der Weltkarte erlaubt es - im Gegensatz zur statischen PDF Version des Schuldenreport - die Verschuldungssituation der Länder nun differenzierter und detailierter zu betrachten. Es ist nun beispielsweise möglich, nicht nur die aggregierte Verschuldungssituation der Länder zu betrachten. Eine Auswahl und Filterfunktion erlaubt nicht nur die aggregierte Verschuldungssituation pro Land, sondern auch in einzelnen Verschuldungskategorien die Situation der Länder zu betrachten. Zudem ist es möglich, nur Länder nach bestimmten Region, Einkommensituationen oder Risikofaktoren anzeigen zu lassen. Darüber hinaus zeigt die Maus (der Mauszeiger) beim Ziehen über einzelnen Länder zusätzliche Informationen an, biespielsweise die konkreten Zahlen der Verschuldungssituation. Durch einen Klick auf das Land ist es zudem möglich, direkt auf das Länderprofil auf erlassjahr.de weitergeleitet zu werden, um dort einen ganzheitlichen Eindruck über die Verschuldungssituation eines Landes zu erhalten. Die individuelle Kartenauswahl kann zudem direkt als Bild heruntergeladen werden. Dadurch sind die Informationsunterlagen direkt auf die unterschiedliche Vorgaben und Interessenschwerpunkte zugeschnitten.\n\n\nDer schlussendliche Arbeitsablauf für die Organisation sieht nun wie folgt aus. Anstatt händisch alle Informationen in eine Excel-Tabelle zu übertragen und mit Adobe Indesin eine Karte einzufärben, wird nun in einem Hauptskript das aktuelle Jahr des Schuldenreports bestimmt. Anschließend wird durch zwei Klicks die Excel-Tabelle mit allen vorhandenen Informationen aus dem vorherigen Schuldenreport und der Weltbank automatisch erstellt.\n\n\nSobald diese Tabelle manuell ergänzt wurde, genügt ein weiterer Klick im Hauptskript um die verschiedenen Indikatoren und Kategorisierungen automatisch zu berechnen. Sobald alle Daten vollständig sind, kann durch einen letzten Klick die Karte aktualisiert werden. Jeder Arbeitsschritt wird im Skript durch eine ausführliche und deutliche Anleitung begleitet und wurde durch eine Einführung praktisch erläutert.\n",
                "impact": "Durch unsere Arbeit haben wir erlassjahr in zwei zentralen Punkten unterstützt. Zum einen haben wir der Organisation dabei geholfen ihre Arbeitsprozesse zu automatisieren und zu optimieren um weniger Zeit auf copy-paste und mehr auf tiefgreifende Recherche zu verwenden. Zum anderen haben wir durch die [interaktive Karte](https://erlassjahr.de/informieren/karte-ueberschuldete-staaten-weltweit/) eine Ergänzung zum statischen Jahresbericht in PDF und Print-Form ermöglicht, durch den Nutzer nun tiefer in die Materie eintauchen können. Es ist nun möglich, die Vielzahl an Parametern und Kategorien die im Jahresbericht beschrieben werden individuell zu erkunden und interaktiv erleben. Somit sind die Karte und die Rechercheergebnisse zugänglicher und erlebbarer für eine größere Gruppe an interessierten Nutzer:innen geworden.\n"
            },
            "en": {
                "summary": "",
                "problem": "erlassjahr.de advocates for fair and transparent debt relief processes worldwide. Similar to other NGOs, the interaction with interested users beyond their web presence is challenging. Until now, research efforts and results on states' debt situation were published in an annual report that featured a static PDF map that visualizes the debt situation worldwide.\n\n\nThe process of collecting and processing the data as well as the creation of the world map was hard work. All information needed to be gathered from different sources and were copy-pasted into an excel sheet. This excel sheet was the basis for the world map where each state was manually colored based on its debt situation. Naturally, a lot of time and effort went into getting the data and processing it further to illustrate a static map with many small and detailed steps that needed to be done by hand. This time and effort could be saved by automating different steps in the process, specifically by simplifying the entire data generation process and by providing a more intuitive and interactive world map. \n\n​\nCorrelAid supported [erlassjahr.de](http://erlassjahr.de/) both in terms of an automated data generation process and the development of an [interactive web-based world map](https://erlassjahr.de/informieren/karte-ueberschuldete-staaten-weltweit/). The goal was to help the team of erlassjahr to have more time focusing on their research while increasing their public outreach to interested users using an interactive version of their annual report data and world debt map.\n​",
                "data": "The data basis consists of many different, oftentimes manually collected and researched sources. These include, among others, the World Bank, the International Monetary Fond, the CIA World Factbook, the government websites of different countries as well as newspaper articles. All information was carefully researched and collected in an excel sheet.\n​\n\nBased on this data, different debt indicators (e.g., public debt relative to state revenue or foreign debt relative to GDP) were calculated that categorize countries in different debt categories. These categories are the fundamental aspect of the annual debt report and are used to color the static world map. Previously, the erlassjahr team used Adobe Indesign to color each country individually according to their aggregated debt level in a process that consumed a lot of time.\n​",
                "approach": "To automate erlassjahr's data and visualization processes as well as to implement a user-friendly and interactive way to engage with their annual research results, our solution consists of two major steps:\n​\n1. The (partial) automation of data generation and data processing\n2. The development and implementation of an [interactive world map](https://erlassjahr.de/informieren/karte-ueberschuldete-staaten-weltweit/) that automatically uses the most recent data available.\n\n​\nWe used R to program and implement all steps and processes. The world map is based on leaflet - a java-based open-source library for interactive world maps. We use shiny for the interface of the web application for the world map.\n​\n### 1. The (partial) automation of data generation and data processing\n​\nThe first step to support the data generation and data processing of erlassjahr is to automate as many steps as possible before starting individual research on different cases. For this purpose, we wrote a script that with each new year automatically transfers all information that remains static from the previous report into a new excel sheet. Examples of this static information are, for instance, the geographic region of each state or the link to each state's country profile on erlassjahr.de. Additionally, we automatically load and include all existing information on the states' debt situation from the website of the World Bank. As a result, a large part of the required information for a given year is already present at the very start of a new year, and only the information that is missing need to be researched and collected individually.\n\n\nIt is important to point out that not all data could be collected automatically given that it oftentimes requires intensive research and the use of many different resources to collect all information that is needed for specific cases. Once the excel sheet is filled with this information, however, a second script can be executed that automatically calculates different indicators and categories. That is, it uses the raw data from the excel sheet and categorizes countries based on different thresholds, for instance, into a higher or lower debt category.\n​\n### 2. The development and implementation of an interactive world map\n​\nBased on this data source, the second step automatically renders an [interactive world map](https://erlassjahr.de/informieren/karte-ueberschuldete-staaten-weltweit/) that includes the most recent information on the debt situation of countries and publishes it on the website of erlassjahr. Even in case that the debt situation changes, the team of erlassjahr can update the data source and re-render the world map to always have the latest changes in the debt situation represented online.\n\n​\nIn contrast to the static PDF version of the world, the web-based interactive world map allows users to explore the debt situation of countries more detailed and efficient. For instance, it is now possible to focus only on specific debt indicators as compared to an aggregate of states' total debt situation. Moreover, countries can now be filtered for specific geographic regions, income situations or risk factors. Furthermore, hovering over countries on the map displays further information such as the exact amount of debt a country has. Clicking on a country takes the user directly to the dedicated country profile on erlassjahr.de where the user receives even more detailed information on the overall history and situation of a country. Finally, the current map view can be downloaded so that all information and filter can be saved to users' personal needs and interests.\n​\n\nThe new workflow for erlassjahr is now as follows. Instead of manually extracting all information in an excel sheet and coloring the map by hand using Adobe Indesign, the team only needs to specify the year for their annual report and execute the first script to automatically receive a pre-populated excel sheet with a lot of information readily available when they start working on their new report. Once the missing information is added, they execute a second script that calculates further variables and categorizes countries depending on their debt situation. A final click to execute the last script uses the most recent data available to create and publish the interactive world map on the website of erlassjahr. All steps are carefully described and the organization received both a workshop on how to use their new workflow set up and a detailed guide on how the different steps work.\n​",
                "impact": "Our support for erlassjahr has two main impacts. First, we helped the team to focus their time and efforts on in-depth research on states' debt levels by replacing manual copy-paste work with automated data generation processes. Second, we implemented an [interactive world map](https://erlassjahr.de/informieren/karte-ueberschuldete-staaten-weltweit/) that complements the static annual report. As a result, it is now possible for users to interactively explore the results in the annual report by selecting different categories and filtering a variety of parameters. This makes the interactive world map more accessible and perceptible for a larger group of users.\n"
            }
        },
        "team": [
            {
                "first_name": "Dennis",
                "last_name": "Hammerschmidt",
                "github": "dennis-hammerschmidt",
                "twitter": "",
                "linkedin": "https://www.linkedin.com/in/dennis-hammerschmidt/",
                "website": "http://dennis-hammerschmidt.rbind.io"
            },
            {
                "first_name": "Antonia",
                "last_name": "Scherz",
                "github": "",
                "twitter": "",
                "linkedin": "https://www.linkedin.com/in/antonia-scherz-7b4740178/",
                "website": ""
            },
            {
                "first_name": "Jonathan",
                "last_name": "Sauer",
                "github": "",
                "twitter": "",
                "linkedin": "",
                "website": "",
                "email": "contact@jonathansauer.de",
                "pgp": "-----BEGIN PGP PUBLIC KEY BLOCK-----\nmDMEX18aHBYJKwYBBAHaRw8BAQdAbCl6uW7PYvHWSbzLYPBFlvnGae07veaHulzb\nEBBWvYO0KUpvbmF0aGFuIFNhdWVyIDxjb250YWN0QGpvbmF0aGFuc2F1ZXIuZGU+\niJYEExYIAD4WIQTIWzN3G55bGDBbu7TFTcB9xs2l8wUCX18aHAIbAwUJCWYBgAUL\nCQgHAgYVCgkICwIEFgIDAQIeAQIXgAAKCRDFTcB9xs2l84isAQDcbPNWalU4Aw3U\ntvjWEd8joivskmszapvS8WSAQbR1vAEAgU6YxHgQei40o8XfMQpoofKP3suo9+qB\n5j0G5J2x8g+4OARfXxocEgorBgEEAZdVAQUBAQdAOE4Ns091Jj6G5+24/aB/+sla\nF0+gqFDEROdp2YyDvScDAQgHiH4EGBYIACYWIQTIWzN3G55bGDBbu7TFTcB9xs2l\n8wUCX18aHAIbDAUJCWYBgAAKCRDFTcB9xs2l83kLAP9U+PCAYegCK2UsuBkqohXF\n75UDn0H3gjJL9YHsH4nzzwEA8eeRtdrci7XkakwY1ljdV2kY+xY3zVfC5qByfxLu\nyAI=\n=X0Bf\n-----END PGP PUBLIC KEY BLOCK-----"
            }
        ]
    }
]

